In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../supershops.csv.csv')

In [3]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [4]:
df.tail()

    Marketing Spend  Administration  Transport     Area    Profit
45          1000.23       124153.04    1903.93    Dhaka  64926.08
46          1315.46       115816.21  297114.46  Rangpur  49490.75
47             0.00       135426.92       0.00      Ctg  42559.73
48           542.05        51743.15       0.00    Dhaka  35673.41
49             0.00       116983.80   45173.06      Ctg  14681.40

In [6]:
x = df.drop('Profit',axis=1)

In [7]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [8]:
y = df['Profit']

In [10]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

# Standard Scaller

In [11]:
from sklearn.preprocessing import StandardScaler

In [12]:
std = StandardScaler()

In [13]:
x.Administration = std.fit_transform(df[['Administration']])

In [14]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61        0.560753  471784.10    Dhaka
1        162597.70        1.082807  443898.53      Ctg
2        153441.51       -0.728257  407934.54  Rangpur
3        144372.41       -0.096365  383199.62    Dhaka
4        142107.34       -1.079919  366168.42  Rangpur

In [17]:
x.Transport = std.fit_transform(df[['Transport']])

In [18]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61        0.560753   2.165287    Dhaka
1        162597.70        1.082807   1.929843      Ctg
2        153441.51       -0.728257   1.626191  Rangpur
3        144372.41       -0.096365   1.417348    Dhaka
4        142107.34       -1.079919   1.273550  Rangpur

In [19]:
x['Marketing Spend'] = std.fit_transform(df[['Marketing Spend']])

In [26]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

# Home Work

In [50]:
x.columns

Index(['Marketing Spend', 'Administration', 'Transport', 'Area'], dtype='object')

In [40]:
for column in x.columns:
    if  x.dtypes[column] != object:
        x[column] = std.fit_transform(x[[column]])

In [41]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

# Min_Max_Scaler

In [51]:
from sklearn.preprocessing import MinMaxScaler
mMc = MinMaxScaler()

for column in x.columns:
    if  x.dtypes[column] != object:
#         print(column)
        x[column] = mMc.fit_transform(x[[column]])

In [52]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

# Max_Abs_Scaler

In [53]:
from sklearn.preprocessing import MaxAbsScaler
maxAbs = MaxAbsScaler()
for column in x.columns:
    if x.dtypes[column] !=object:
        x[column]=maxAbs.fit_transform(x[[column]])

In [54]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

# Robust_Scaler

In [55]:
from sklearn.preprocessing import RobustScaler
rbs = RobustScaler()
for columns in x.columns:
    if x.dtypes[columns] != object:
        x[columns]=rbs.fit_transform(x[[columns]])

In [56]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.672530        0.345355   1.552016    Dhaka
1         1.452113        0.697565   1.383714      Ctg
2         1.303634       -0.524290   1.166654  Rangpur
3         1.156567       -0.097977   1.017368    Dhaka
4         1.119836       -0.761543   0.914576  Rangpur